modules/testsuite/native-tests/src/test/resources/common/soap/jbws2693.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:jbw='http://ws.jboss.org/jbws2693'>
  <soapenv:Header/>
  <soapenv:Body>
    <jbw:echo>
      <arg0>123</arg0>
    </jbw:echo>
  </soapenv:Body>
</soapenv:Envelope>